Revit 2027 API
Curve.ComputeDerivatives Method
 Returns the vectors describing the curve at the specified parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform ComputeDerivatives(
	double parameter,
	bool normalized
)
Public Function ComputeDerivatives (
	parameter As Double,
	normalized As Boolean
) As Transform
public:
Transform^ ComputeDerivatives(
	double parameter,
	bool normalized
)
member ComputeDerivatives :
        parameter : float *
        normalized : bool -> Transform
Parameters
parameter Double
 The parameter to be evaluated.
normalized Boolean
 If false, param is interpreted as natural parameterization of the curve. If true, param is expected to be in [0,1] interval mapped to the bounds of the curve. Setting to true is valid only if the curve is bound.
Return Value
Transform
 The transformation containing the point on the curve, the tangent vector, derivative of tangent vector, and bi-normal vector.
Exceptions
Exception | Condition
ArgumentException |  The given value for parameter is not finite
ArgumentOutOfRangeException |  The curve cannot be evaluated as normalized because it is unbound. -or- The parameter is not a valid value for normalized evaluation.
Remarks
 The following is the meaning of the transformation members:
Origin is the point on the curve (equivalent to Evaluate(Double, Boolean)).
BasisX is the tangent vector (the first derivative).
BasisY is the second derivative. Note that for curves where this cannot be uniquely determined (e.g. lines), this will be a Zero vector.
BasisZ is the bi-normal vector (tangent x normal). Note that for curves where normal cannot be uniquely determined (e.g. lines), this will be a Zero vector.
 None of the vectors are normalized.
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace